All solutions:[[org:../Education/coursera_learning/katas/leetcode/notes.org]]


# Rust
:PROPERTIES:
:LEVEL: 0
:END:
#+BEGIN_SRC rust


struct Solution {}

impl Solution {
    pub fn find_target_sum_ways(nums: Vec<i32>, target: i32) -> i32 {
        Self::recur(&nums, 0, nums.len()-1, target)
    }

    fn recur(nums: &[i32], index: usize, last_elem: usize, target: i32) -> i32 {
        if index == last_elem {
            let positive = target + nums[index] == 0;
            let negative = target - nums[index] == 0;
            if positive && negative {
                return 2
            } else if positive || negative {
                return 1
            } else {
                return 0
            }
        }

        let last = nums[index];

        let positive = Self::recur(&nums, index + 1, last_elem, target+last);
        let negative = Self::recur(&nums, index + 1, last_elem, target+(-1 * last));

        positive + negative
    }
}

fn main() {

}
#+END_SRC

#+RESULTS:
#+begin_example
warning: struct is never constructed: `Solution`
 --> src/main.rs:4:8
  |
4 | struct Solution {}
  |        ^^^^^^^^
  |
  = note: `#[warn(dead_code)]` on by default

warning: associated function is never used: `find_target_sum_ways`
 --> src/main.rs:7:12
  |
7 |     pub fn find_target_sum_ways(nums: Vec<i32>, target: i32) -> i32 {
  |            ^^^^^^^^^^^^^^^^^^^^

warning: associated function is never used: `recur`
  --> src/main.rs:11:8
   |
11 |     fn recur(nums: &[i32], index: usize, last_elem: usize, target: i32) -> i32 {
   |        ^^^^^

warning: 3 warnings emitted

warning: struct is never constructed: `Solution`
 --> src/main.rs:4:8
  |
4 | struct Solution {}
  |        ^^^^^^^^
  |
  = note: `#[warn(dead_code)]` on by default

warning: associated function is never used: `find_target_sum_ways`
 --> src/main.rs:7:12
  |
7 |     pub fn find_target_sum_ways(nums: Vec<i32>, target: i32) -> i32 {
  |            ^^^^^^^^^^^^^^^^^^^^

warning: associated function is never used: `recur`
  --> src/main.rs:11:8
   |
11 |     fn recur(nums: &[i32], index: usize, last_elem: usize, target: i32) -> i32 {
   |        ^^^^^

warning: 3 warnings emitted

#+end_example

## Some notes
 If you will move from back to first elem think about [0, 1] case.
 -0+1 //this one work
 -0-1
 +0+1 //this one works too, and you might loose one of them if you substract 1 first
 +0-1

 If you will move from start to an end this about [1,0]
 -1+0
 -1-0
 +1+0 // this one works
 +1-0 // this one two
 if you write target + nums[index] == 0 || target - nums[index] == 0 you might
 loose one of it



 In this solution we are using memoization but it is not as effective because we have to match index + targetSum for memo key.
 So we cannot memoize a lot actually.

# Alternative solution with a bit better logic on a last step
:PROPERTIES:
:LEVEL: 0
:END:
[[https://play.rust-lang.org/?version=stable&mode=debug&edition=2018&gist=0c9e798b8c09d66810b304f3e96d57c1][Rust Playground]]
#+BEGIN_SRC rust

struct Solution {}

impl Solution {
    pub fn find_target_sum_ways(nums: Vec<i32>, target: i32) -> i32 {
        let mut memo = std::collections::HashMap::new();
        Self::recur(&nums, 0, nums.len(), target, &mut memo)
    }

    fn recur(nums: &[i32], index: usize, length: usize, target: i32, memo: &mut std::collections::HashMap<(usize, i32), i32>) -> i32 {
        if index == length && target == 0 { return 1 }
        if index == length && target != 0 { return 0 }

        let key = (index, target);
        if memo.contains_key(&key) { return memo[&key] }

        let num = nums[index];

        let positive = Self::recur(&nums, index + 1, length, target + num, memo);
        let negative = Self::recur(&nums, index + 1, length, target - num, memo);

        memo.insert(key, positive + negative);

        memo[&key]
    }
}

fn main() {
    Solution::find_target_sum_ways([1,2,3].to_vec(), 6);
}
#+END_SRC

#+RESULTS:

For C++ solution below I didn't even have to use any tricks and lack of memo was not a problem.
Just stupid recursion and incrementing the count in the end.
#+begin_src cpp
class Solution {
public:
    void traverse(vector<int>& nums, int index, int current_sum, int target) {
        if (index == nums.size()) {
            if (current_sum == target) {
                total_count++;
            }

            return;
        }

        traverse(nums, index+1, current_sum + nums[index], target);
        traverse(nums, index+1, current_sum - nums[index], target);
    }

    int findTargetSumWays(vector<int>& nums, int target) {
        total_count = 0;
        traverse(nums, 0, 0, target);
        return total_count;
    }

private:
    int total_count;
};
#+end_src

I have tried to move to a lambda solution from this, but got time limit
#+begin_src cpp
class Solution {
public:
  int findTargetSumWays(vector<int>& nums, int target) {
    total_count = 0;

    function<void(int, int)> traverse = [&](int index, int current_sum){
      if (index == nums.size()) {
        if (current_sum == target) {
          total_count++;
        }

        return;
      }

      traverse(nums, index+1, current_sum + nums[index], target);
      traverse(nums, index+1, current_sum - nums[index], target);
    };

    traverse(nums, 0, 0, target);
    return total_count;
  }
};
#+end_src

Have to use memo technic and approach, now return 1 if match and 0 if not to allow effective memoization of tails
#+begin_src cpp
class Solution {
public:
    int findTargetSumWays(vector<int>& nums, int target) {
        map<pair<int, int>, int> memo;

        function<int(int,int)> traverse = [&](int index, int current_sum) {
            if (index == nums.size()) {
                return current_sum == target ? 1 : 0;
            }

            if (memo.contains({index, current_sum})) {
                return memo[{index, current_sum}];
            }

            int ways =
                traverse(index + 1, current_sum + nums[index]) +
                traverse(index + 1, current_sum - nums[index]);
            memo[{index, current_sum}] = ways;
            return ways;
        };

        return traverse(0, 0);
    }
};
#+end_src
